# Authored By Certified Coders © 2025
# NUCLEAR PERFORMANCE MODE (Unlimited / True Power) ☢️🚀

import asyncio
import os

# بنجيب عدد الأنوية، ولو معرفش يعتبره 16 (زي ما انت قولت سيرفرك قوي)
CPU = os.cpu_count() or 16

# === إعدادات "اللا محدود" (Unlimited) ===

# عدد التحميلات المتزامنة:
# خليناه 1000 عملية! 
# ده معناه "True"، مفيش طابور انتظار، اللي ييجي يدخل يحمل فوراً.
MAX_CONCURRENT = 1000 

# حجم البفر (الذاكرة المؤقتة):
# خليناها 16 ميجا بايت (كانت 1 وبعدين 8)
# ده رقم مرعب، الملف الـ 5 دقايق هينزل في 3 أو 4 "قطمات" بس!
CHUNK_SIZE = 1024 * 1024 * 16 

# === إعدادات الوقت والذاكرة ===

# وقت الانتظار (Timeouts)
# 30 ثانية بس! يا تلحق يا تموت ويجي غيرك.
YTDLP_TIMEOUT = 30

# مدة الكاش
# ساعة كاملة (3600 ثانية) عشان السيرفر ميعملش مجهود ملوش لازمة مرتين.
YOUTUBE_META_TTL = 3600

# حجم الكاش
# 50,000 نتيجة.. البوت هيفتكر تاريخ اليوتيوب كله.
YOUTUBE_META_MAX = 50000

# البوابة المفتوحة عيمشيري
SEM = asyncio.Semaphore(MAX_CONCURRENT)
